; domain
;Domain description
(define (domain harbor) ; Domain name must match problem’s
; Define what the planner must support to execute this domain

 (:requirements
 :strips ; basic preconditions and effects
 :negative-preconditions ; to use not in preconditions;
 :equality ;to use = in preconditions
 :disjunctive-preconditions ;to use or in preconditions
 :typing ;to use types
 )
 
 (:types
 dock
 container
 robot
 )
 
 (:predicates
(connected ?d1 - dock ?d2 - dock) ; Docks ?d1 and ?d2 are connected
(ondock ?c - container ?d - dock) ;Container ?c is located at dock ?d
(robot-at ?r - robot ?d - dock) ;Robot ?r is at dock ?d
(carrying ?r - robot ?c - container) ;Robot ?r is carrying container ?c
(free ?r - robot) ;Robot ?r is not carrying a container
(on ?base - container ?top - container) ;Container ?c2 is on top of container ?c1
(clear ?c - container) ;Container has no other container on top of it
)

 (:action move
:parameters (?r - robot ?from - dock ?to - dock)
:precondition (and (robot-at ?r ?from) (connected ?from ?to))
:effect (and (not (robot-at ?r ?from)) (robot-at ?r ?to))
 )
 
 (:action pickup
 :parameters (?r - robot ?c - container ?d - dock)
 :precondition (and (robot-at ?r ?d) (free ?r) (ondock ?c ?d) (clear ?c))
 :effect (and (not (ondock ?c ?d)) (not (clear ?c)) (carrying ?r ?c) (not (free ?r)))
 )
 
 (:action drop
 :parameters (?r - robot ?c - container ?d - dock)
 :precondition (and (robot-at ?r ?d) (carrying ?r ?c) (not (free ?r)))
 :effect (and (not (carrying ?r ?c)) (ondock ?c ?d) (clear ?c) (free ?r))
 )
 
 (:action stack
 :parameters (?r - robot ?base - container ?top - container ?d - dock)
 :precondition (and (robot-at ?r ?d) (carrying ?r ?top) (not (free ?r)) (ondock ?base ?d) (clear ?base))
 :effect (and (not (carrying ?r ?top)) (on ?base ?top) (not (clear ?base)) (clear ?top) (free ?r))
 )
 
 (:action unstack
  :parameters (?r - robot ?base - container ?top - container ?d - dock)
  :precondition (and (robot-at ?r ?d) (on ?base ?top) (clear ?top) (free ?r) (ondock ?base ?d))
  :effect (and (not (on ?base ?top)) (carrying ?r ?top) (clear ?base) (not (free ?r)))
  )            
)

; problem
;Problem description
;Describe the objects, the initial state and the goals
(define (problem harbor)
(:domain harbor)
(:objects
d1 d2 d3 - dock
c1 c2 c3 - container
r1 - robot
)
 
(:init
(connected d1 d2) (connected d2 d1) (connected d1 d3) (connected d3 d1)
(ondock c2 d2) (ondock c1 d1)
(on c1 c3)
(robot-at r1 d2) (free r1)
(clear c3) (clear c2)
)

(:goal
(and (robot-at r1 d1) (ondock c2 d3) (ondock c3 d3) (on c2 c1) (free r1) (clear c3) (clear c1))
)

)

; plan
1. (move r1 d2 d1)
   deleted: (robot-at r1 d2)
   added: (robot-at r1 d1)
   goals met: 3 of 7
2. (unstack r1 c1 c3 d1)
   deleted: (on c1 c3) (free r1)
   added: (carrying r1 c3) (clear c1)
   goals met: 3 of 7
3. (move r1 d1 d3)
   deleted: (robot-at r1 d1)
   added: (robot-at r1 d3)
   goals met: 2 of 7
4. (drop r1 c3 d3)
   deleted: (carrying r1 c3)
   added: (ondock c3 d3) (free r1)
   goals met: 4 of 7
5. (move r1 d3 d1)
   deleted: (robot-at r1 d3)
   added: (robot-at r1 d1)
   goals met: 5 of 7
6. (pickup r1 c1 d1)
   deleted: (ondock c1 d1) (clear c1) (free r1)
   added: (carrying r1 c1)
   goals met: 3 of 7
7. (move r1 d1 d2)
   deleted: (robot-at r1 d1)
   added: (robot-at r1 d2)
   goals met: 2 of 7
8. (drop r1 c1 d2)
   deleted: (carrying r1 c1)
   added: (ondock c1 d2) (clear c1) (free r1)
   goals met: 4 of 7
9. (pickup r1 c2 d2)
   deleted: (ondock c2 d2) (clear c2) (free r1)
   added: (carrying r1 c2)
   goals met: 3 of 7
10. (move r1 d2 d1)
   deleted: (robot-at r1 d2)
   added: (robot-at r1 d1)
   goals met: 4 of 7
11. (move r1 d1 d3)
   deleted: (robot-at r1 d1)
   added: (robot-at r1 d3)
   goals met: 3 of 7
12. (drop r1 c2 d3)
   deleted: (carrying r1 c2)
   added: (ondock c2 d3) (clear c2) (free r1)
   goals met: 5 of 7
13. (move r1 d3 d1)
   deleted: (robot-at r1 d3)
   added: (robot-at r1 d1)
   goals met: 6 of 7
14. (move r1 d1 d2)
   deleted: (robot-at r1 d1)
   added: (robot-at r1 d2)
   goals met: 5 of 7
15. (pickup r1 c1 d2)
   deleted: (ondock c1 d2) (clear c1) (free r1)
   added: (carrying r1 c1)
   goals met: 3 of 7
16. (move r1 d2 d1)
   deleted: (robot-at r1 d2)
   added: (robot-at r1 d1)
   goals met: 4 of 7
17. (move r1 d1 d3)
   deleted: (robot-at r1 d1)
   added: (robot-at r1 d3)
   goals met: 3 of 7
18. (stack r1 c2 c1 d3)
   deleted: (carrying r1 c1) (clear c2)
   added: (on c2 c1) (clear c1) (free r1)
   goals met: 6 of 7
19. (move r1 d3 d1)
   deleted: (robot-at r1 d3)
   added: (robot-at r1 d1)
   goals met: 7 of 7
